{
  "head": {
    "chapter": {
      "id": 0,
      "value": "Javascript"
    },
    "title": "Le DOM et la structure d'une page web",
    "resume": "Quand la technologie s'inspire de la nature"
  },
  "intro": {
    "left": [
      {
        "type": "h3",
        "value": "Pour apprendre à coder…"
      },
      {
        "type": "h4",
        "value": "…il faut comprendre comment se construit une page web."
      },
      {
        "type": "p",
        "value": "Avant de se lancer dans les lignes de code, on va comprendre comment se structure un fichier HTML."
      }
    ],
    "right": [
      {
        "type": "img",
        "src": "",
        "alt": ""
      }
    ]
  },
  "content": [
    {
      "type": "h4",
      "value": "Under the DOM"
    },
    {
      "type": "p",
      "value": "Le <b>DOM</b> (Document Object Model) d’une page web est par définition sa structure HTML. Il se représente comme un arbre généalogique avec ses branches qui sont les enfants de l’élément racine. Ces branches sont appelées des <b>noeuds</b> et ces noeuds sont représentés en HTML par des <b>balises</b>."
    },
    {
      "type": "code",
      "language": "html",
      "fileName": "index.html",
      "value": "<balise> </balise>"
    },
    {
      "type": "p",
      "value": "L’élement racine d’un fichier HTML est la balise <b>html</b>. Cette racine a deux enfants (donc deux noeuds) : <b>head</b> (donne des informations sur le site au navigateur et récupère le CSS) et <b>body</b> (contient toute la partie visuelle du site). Et ces enfants ont bien entendu de multiples autres enfants qui pourront également avoir des enfants eux aussi. Mais un bout de code vaut mille mots :"
    },
    {
      "type": "code",
      "language": "html",
      "fileName": "index.html",
      "value": "<!DOCTYPE html>\n<html>\n <head>\n  <title>Titre de ma page</title>\n </head>\n\n <body>\n  <h1>Un super titre</h1>\n  <div>\n   <p>Mon paragraphe</p>\n  </div>\n </body>\n</html>"
    },
    {
      "type": "p",
      "value": "Donc dans cet exemple, la balise <b>html</b> a deux noeuds: <b>head</b> et <b>body</b>. <br>La balise <b>head</b> a un noeud: <b>title</b>. <br>La balise body a deux noeuds: <b>h1</b> et <b>div</b>. <br>Et la balise <b>div</b> a un noeud: <b>p</b>."
    },
    {
      "type": "p",
      "value": "<span class='note'>NOTE</span> Tu peux remarquer au debut de mon code une étrange balise <b>DOCTYPE</b>. Cette balise ne fait pas parti du DOM mais elle est nécessaire (et obligatoire!). Elle est là pour préciser au navigateur que c'est bien du HTML qu'il lira. Car oui des langages de balises, il n'y en a pas qu'un... Exemple: le <b>XML</b>."
    },
    {
      "type": "p",
      "value": "<span class='spoil'>SPOIL</span> Je m'avance un peu mais grâce au DOM, on pourra se déplacer librement dans l'arborescence de notre page avec Javascript afin de récupérer un ou plusieurs noeuds en particulier."
    },
    {
      "type": "p",
      "value": "Tu peux voir dans mon exemple que chaque enfant est décalé d'une tabulation. C'est une norme de lisibilité pour les développeurs mais tu peux très bien ne pas aller à la ligne et ne pas mettre de tabulations. Ton navigateur web comprendra très bien ton code. Toi par contre c'est moins sûr..."
    },
    {
      "type": "code",
      "language": "html",
      "fileName": "index.html",
      "value": "<!DOCTYPE html><html><head><title>Titre de ma page</title></head><body><h1>Un super titre</h1><div><p>Mon paragraphe</p></div></body></html>"
    },
    {
      "type": "p",
      "value": "Et encore, il n'y a qu'un titre et un pargraphe de coder... Je vais donc partir du principe que tu iras à la ligne et que tu ajouteras une tabulation à chaque noeuds de ton DOM. 😎"
    },
    {
      "type": "h4",
      "class": "mt-8",
      "value": "Et le Javascript dans tout ça, il est où ?"
    },
    {
      "type": "p",
      "value": "Le Javascript se trouve dans une balise <b>script</b> qui vient se positionner juste avant la fermeture de la balise <b>body</b>, donc après tout ton contenu."
    },
    {
      "type": "code",
      "language": "html",
      "fileName": "index.html",
      "value": "<!DOCTYPE html>\n<html>\n <head>\n  <title>Titre de ma page</title>\n </head>\n\n <body>\n  <h1>Un super titre</h1>\n  <div>\n   <p>Mon paragraphe</p>\n  </div>\n  <script type='text/javascript' src='mon/chemin.js'></script>\n </body>\n</html>"
    },
    {
      "type": "p",
      "value": "Pourquoi pas dans le <b>head</b> ou en début de <b>body</b> ? Et bien car pour afficher ta page, ton navigateur va construire le DOM de haut en bas. Donc si tu insères du codes Javascript qui va récupérer un noeud dans ton DOM, mais que le DOM n'est pas encore créé, rien ne va marcher."
    },
    {
      "type": "p",
      "value": "Allez, maintenant qu'on a compris ça, on va pouvoir rentrer dans le vif du sujet !"
    }
  ]
}